<?php


/*
╔╗──╔╗╔╗╔╗─╔╗╔══╗╔══╗╔═══╗╔═══╗
║║──║║║║║╚═╝║║╔═╝║╔╗║║╔═╗║║╔══╝
║║──║║║║║╔╗─║║║──║║║║║╚═╝║║╚══╗
║║──║║║║║║╚╗║║║──║║║║║╔╗╔╝║╔══╝
║╚═╗║╚╝║║║─║║║╚═╗║╚╝║║║║║─║╚══╗
╚══╝╚══╝╚╝─╚╝╚══╝╚══╝╚╝╚╝─╚═══╝
*/

namespace pocketmine\permission;


interface ServerOperator {
	/**
     * Проверяет, есть ли у текущего объекта права оператора
	 *
	 * @return bool
	 */
	public function isOp();

	/**
     * Устанавливает разрешение оператора для текущего объекта
	 *
	 * @param bool $value
	 *
	 * @return void
	 */
	public function setOp($value);
}